src/wf/test/testSOAP.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
	xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Header />
	<SOAP-ENV:Body>
		<NodeTransitionEvent xmlns="http://wf.net/events">
			<Timestamp>2003-09-12 13:23:23.2</Timestamp>
			<WorkflowName>CreditApproval</WorkflowName>
			<WorkflowVersion>1</WorkflowVersion>
			<WorkflowInstanceId>1233</WorkflowInstanceId>
			<From nodeId="222" nodeName="CheckCredit"
				nodeType="Process" />
			<To nodeId="223" nodeName="ApproveCredit"
				nodeType="Process" />
			<WorkItem>
				<WorkItemId>9999</WorkItemId>
				<Payload type="XML">
					<credit>
						<ssn>83838838383</ssn>
						<name>John Doe</name>
						<score>800</score>
					</credit>
				</Payload>
				<Properties>
					<Property>
						<Name>PropA</Name>
						<Type>String</Type>
						<Value>xxxxxx</Value>
					</Property>
					<Property>
						<Name>PropB</Name>
						<Type>Integer</Type>
						<Value>9999</Value>
					</Property>
				</Properties>
			</WorkItem>
		</NodeTransitionEvent>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
